Table of Contents
 Class GrpcReflectionMessageHandler
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
Handler that invokes methods for specified object over Grpc via reflection.
public class GrpcReflectionMessageHandler : IGrpcMessageHandler<object>, IGrpcMessageHandler
Inheritance
object
GrpcReflectionMessageHandler
Implements
IGrpcMessageHandler<object>
IGrpcMessageHandler
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 GrpcReflectionMessageHandler(object, IPluginLogger)
Initializes new GrpcReflectionMessageHandler
public GrpcReflectionMessageHandler(object instance, IPluginLogger logger)
Parameters
instance object
Instance for which the messages will be handled.
logger IPluginLogger
Properties
 IsSynchronous
public bool IsSynchronous { get; }
Property Value
bool
Methods
 HandleClientMessage(GrpcMessage, IGrpcSender)
Handles response incoming from the server.
public Task<object> HandleClientMessage(GrpcMessage message, IGrpcSender client)
Parameters
message GrpcMessage
Message sent by server.
client IGrpcSender
Returns
Task<object>
 HandleServerMessage(GrpcMessage, IGrpcSender)
Handles request incoming from the client.
public Task<object> HandleServerMessage(GrpcMessage message, IGrpcSender grpcSender)
Parameters
message GrpcMessage
Message sent by client.
grpcSender IGrpcSender
Returns
Task<object>
 Edit this page